In [1]:
import pandas as pd
import numpy as np

In [2]:
from pandas import Series,DataFrame

In [5]:
import webbrowser
link = "https://www.tiobe.com/tiobe-index/"
webbrowser.open('link')

True

In [10]:
df = pd.read_clipboard()

In [11]:
df

,Feb,2018,Feb.1,2017,Change,Programming,Language,Ratings,Change.1
0,1,1,Java,14.988%,-1.69%,NaN,NaN,NaN,NaN
1,2,2,C,11.857%,+3.41%,NaN,NaN,NaN,NaN
2,3,3,C++,5.726%,+0.30%,NaN,NaN,NaN,NaN
3,4,5,change,Python,5.168%,+1.12%,NaN,NaN,NaN
4,5,4,change,C#,4.453%,-0.45%,NaN,NaN,NaN
5,6,8,change,Visual,Basic,.NET,4.072%,+1.25%,NaN
6,7,6,change,PHP,3.420%,+0.35%,NaN,NaN,NaN
7,8,7,change,JavaScript,3.165%,+0.29%,NaN,NaN,NaN
8,9,9,Delphi/Object,Pascal,2.589%,+0.11%,NaN,NaN,NaN
9,10,11,change,Ruby,2.534%,+0.38%,NaN,NaN,NaN

In [12]:
type(df)

pandas.core.frame.DataFrame

In [13]:
df.columns

Index(['Feb', '2018', 'Feb.1', '2017', 'Change', 'Programming', 'Language',
       'Ratings', 'Change.1'],
      dtype='object')

In [14]:
df.Ratings

0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
5    +1.25%
6       NaN
7       NaN
8       NaN
9       NaN
Name: Ratings, dtype: object

In [15]:
df_new = DataFrame(df,columns=['Feb'])

In [16]:
df_new

   Feb
0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9   10

In [17]:
df.Feb

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: Feb, dtype: int64

In [18]:
df['Feb']

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: Feb, dtype: int64

In [21]:
df_new['sdsdfds'] = range(0,10) # 赋值

In [22]:
df_new

   Feb  sdsdfds
0    1        0
1    2        1
2    3        2
3    4        3
4    5        4
5    6        5
6    7        6
7    8        7
8    9        8
9   10        9

In [25]:
df_new['sep'] = np.arange(0,10) # 赋值二

In [26]:
df_new #

   Feb  sdsdfds  sep
0    1        0    0
1    2        1    1
2    3        2    2
3    4        3    3
4    5        4    4
5    6        5    5
6    7        6    6
7    8        7    7
8    9        8    8
9   10        9    9

In [29]:
df_new['ddd'] = pd.Series(np.arange(0,10)) # 赋值三

In [30]:
df_new

   Feb  sdsdfds  sep  ddd
0    1        0    0    0
1    2        1    1    1
2    3        2    2    2
3    4        3    3    3
4    5        4    4    4
5    6        5    5    5
6    7        6    6    6
7    8        7    7    7
8    9        8    8    8
9   10        9    9    9

In [31]:
# 指定特定的index赋值

In [34]:
df_new['sep'] = pd.Series([100,200],index=[1,2])

In [35]:
df_new

   Feb  sdsdfds    sep    ddd
0    1        0    NaN    NaN
1    2        1  100.0  100.0
2    3        2  200.0  200.0
3    4        3    NaN    NaN
4    5        4    NaN    NaN
5    6        5    NaN    NaN
6    7        6    NaN    NaN
7    8        7    NaN    NaN
8    9        8    NaN    NaN
9   10        9    NaN    NaN